from string import Template

#### RAG PROMPTS ####

#### System ####
system_prompt = Template("أنت مساعد لتوليد رد للمستخدم.\nستحصل على مجموعة من المستندات المرتبطة باستفسار المستخدم.\nعليك توليد رد بناءً على المستندات المقدمة.\nتجاهل المستندات التي لا تتعلق باستفسار المستخدم.\nيمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.\nعليك توليد الرد بنفس لغة استفسار المستخدم.\nكن مؤدباً ومحترماً في التعامل مع المستخدم.\nكن دقيقًا ومختصرًا في ردك. تجنب المعلومات غير الضرورية.")

#### Document ####
document_prompt = Template(
    "## المستند رقم: $doc_num\n### المحتوى: $chunk_text"
)

#### Footer ####
footer_prompt = Template("أجب على استفسار المستخدم التالي باستخدام المستندات المقدمة فقط.\nتعليمات صارمة:\n- لا تقم بتلخيص المستندات.\n- تجاهل تماماً أي معلومات لا تجيب بشكل مباشر على سؤال المستخدم.\n- كن مختصراً ومحدداً جداً.\n\n## استفسار المستخدم: $query\n## الإجابة:")
